{
    "roles": {
        "reader": {
            "reader": "هو قارئ ويستطيع الإعجاب والتعليق والمتابعة والاشتراك"
        },
        "author": {
            "author": "هو كاتب ويستطيع الإعجاب والتعليق والمتابعة والاشتراك وكتابة القصص ونشرها",
            "stories": "علاقة واحد إلى متعدد - الكاتب يمكنه كتابة عدة قصص"
        },
        "admin": {
            "admin_reader": "نفس صلاحيات القارئ ولكن يستطيع حذف التعليقات والإعجابات وحذف القصة أو رفضها قبل النشر وحل النزاعات بين المستخدمين",
            "admin_author": "نفس صلاحيات الكاتب ولكن يستطيع حذف التعليقات والإعجابات وحذف القصة أو رفضها قبل النشر وحل النزاعات بين المستخدمين",
            "approved_stories": "علاقة واحد إلى متعدد - المشرف يمكنه الموافقة على عدة قصص"
        },
        "super_admin": {
            "super_admin_reader": "نفس صلاحيات admin_reader مع القدرة على الإدارة العليا مثل التحكم بالمشرفين والمراجعة",
            "super_admin_author": "نفس صلاحيات admin_author مع القدرة على الإدارة العليا مثل التحكم بالمشرفين والمراجعة",
            "approved_stories": "علاقة واحد إلى متعدد - المشرف الأعلى يمكنه الموافقة على عدة قصص",
            "managed_admins": "علاقة واحد إلى متعدد - المشرف الأعلى يمكنه إدارة عدة مشرفين"
        },
        "education_center": {
            "education_center": "مركز تعليمي وجميع الحسابات التابعة له هي قارئة",
            "teachers": "علاقة واحد إلى متعدد - المركز التعليمي يمكن أن يضم عدة معلمين"
        },
        "education_center_teacher": {
            "education_center_teacher": "هو معلم تابع للمركز التعليمي ويستطيع الإعجاب والتعليق والمتابعة والاشتراك وإنشاء محتوى تعليمي",
            "students": "علاقة واحد إلى متعدد - المعلم يمكنه تدريس عدة طلاب"
        },
        "education_center_student": {
            "education_center_student": "هو طالب تابع للمركز التعليمي ويستطيع الإعجاب والتعليق والمتابعة والاشتراك"
        },
        "owner": {
            "owner": "مالك النظام ولديه جميع الصلاحيات الكاملة للتحكم في النظام"
        },
        "relationships": {
            "one_to_many": {
                "author_to_stories": "كاتب واحد يمكنه كتابة قصص متعددة",
                "admin_to_approved_stories": "مشرف واحد يمكنه الموافقة على قصص متعددة",
                "super_admin_to_stories_and_admins": "مشرف أعلى واحد يمكنه الموافقة على قصص متعددة وإدارة مشرفين متعددين",
                "education_center_to_teachers": "مركز تعليمي واحد يمكن أن يضم معلمين متعددين",
                "teacher_to_students": "معلم واحد يمكنه تدريس طلاب متعددين"
            }
        },
        "general": {
            "role_list": [
                "reader", 
                "author", 
                "admin_reader", 
                "admin_author", 
                "super_admin_reader", 
                "super_admin_author", 
                "education_center", 
                "education_center_teacher", 
                "education_center_student", 
                "owner"
            ],
            "role_description": "الحقل الذي يحدد دور المستخدم المسجل في النظام"
        }
    }
}